In [1]:
import pandas as pd
dictionary = {  "NAME":["ali","veli","kenan","hilal","ayse","evren"],
                "AGE":[15,16,17,33,45,66],
                "SALARY": [100,150,240,350,110,220],
                "NEW_FEATURE": [-1, -2, -3, -4 ,-5, -6]} 
dataFrame1 = pd.DataFrame(dictionary) # Verilen bir listi (dict) kullanarak, bir veri tablosu oluşturur.
print(dataFrame1)

    NAME  AGE  SALARY  NEW_FEATURE
0    ali   15     100           -1
1   veli   16     150           -2
2  kenan   17     240           -3
3  hilal   33     350           -4
4   ayse   45     110           -5
5  evren   66     220           -6

In [2]:
dataFrame1.columns = [ each.lower() for each in dataFrame1.columns]
print(dataFrame1.columns)

Index(['name', 'age', 'salary', 'new_feature'], dtype='object')

In [3]:
print(dataFrame1.columns)

Index(['name', 'age', 'salary', 'new_feature'], dtype='object')

In [4]:
# axis=1 => yukarıdan aşağı drop et (column drop). 
# axis=0 => soldan sağa drop et (row drop).
# inplace dataFrame1'de drop edilmiş haliye yerine koyar, günceller.
dataFrame1.drop(["new_feature"],  axis=1, inplace = True)

In [5]:
print(dataFrame1)

    name  age  salary
0    ali   15     100
1   veli   16     150
2  kenan   17     240
3  hilal   33     350
4   ayse   45     110
5  evren   66     220

In [6]:
data1 = dataFrame1.head() # ilk 5 satır
data2 = dataFrame1.tail() # son 5 satır

In [7]:
# vertical merge(concat)
# axis 0 concatta yukardan aşağı, axis 1 concatta soldan sağı merge yapar.
data_concat = pd.concat([data1, data2], axis=0) 
data_concat

    name  age  salary
0    ali   15     100
1   veli   16     150
2  kenan   17     240
3  hilal   33     350
4   ayse   45     110
1   veli   16     150
2  kenan   17     240
3  hilal   33     350
4   ayse   45     110
5  evren   66     220

In [8]:
# horizontal
# axis=1 horizontal
salary = dataFrame1.salary
age = dataFrame1.age

data_h_concat = pd.concat([salary, age], axis=1)
print(data_h_concat)

   salary  age
0     100   15
1     150   16
2     240   17
3     350   33
4     110   45
5     220   66